{"Outline": "1. massively parallel distributed process or made up of simple processing units 2. knowledge acquired from environment through a learning process 3. knowledge stored in the form of synaptic weights"}{"Evolutionary Computation": "1. biologically inspired 2. good learning properties 3. continuous, nonlinear 4. well adapted to certain tasks 5. fault tolerant 6. graceful degradation"}{"Recall: Hill Climbing": "1. 380BC Plato (Rationalism - innateness) 2. 330BC Aristotle (Empricism - experience) 3. 1641 Descartes (mind-body Dualism) 4. 1781 Kant (Critique of Pure Reason) 5. 1899 Sigmund Freud (Psychology) 6. 1953 B.F. Skinner (Behaviourism)"}{"Evolutionary Computation": "1. 1642 Blaise Pascal (mechanical adding machine) 2. 1694 Gottfried Leibniz (mechanical calculator) 3. 1769 Wolfgang von Kempelen (Mechanical Turk) 4. 1837 Charles Babbage & Ada Lovelace (Difference Engine) 5. 1848 George Boole (the Calculus of Logic) 6. 1879 Gottlob Frege (Predicate Logic) 7. 1950 Turing Test 8. 1956 Dartmouth conference"}{"Evolutionary Issues": "1. 1943 McCulloch & Pitts (neuron models) 2. 1948 Norbert Wiener (Cybernetics) 3. 1948 Alan Turing (B-Type Networks) 4. 1955 Oliver Selfridge (Pattern Recognition) 5. 1962 Hubel and Wiesel (visual cortex) 6. 1962 Frank Rosenblatt (Perceptron)"}{"Representations": "1. 1956 Newell & Simon (Logic Theorist) 2. 1959 John McCarthy (Lisp) 3. 1959 Arther Samuel (Checkers) 4. 1965 Joseph Weizenbaum (ELIZA) 5. 1967 Edward Feigenbaum (Dendral)"}{"Bit String Crossovers": "1. 1969 Minsky & Papert published Perceptrons, emphasizing the limitations of neural models, and lobbied agencies to cease funding neural network research. 2. from 1969 to 1985 there was very little work in neural networks or machine learning. 3. a few exceptions, e.g. Stephen Grossberg, Teuvo Kohonen (SOM), Paul Werbos."}{"Genetic Algorithms": "1. 1970s and early 1980s, AI research focused on symbolic processing, Expert Systems 2. Some commercial success, but ran into difficulties:(1). combinatorial explosion in search spaces (2). difficulty of formalising everyday knowledge as well as expert knowledge"}{"Schema Theorem": "1. 1986 Rumelhart, Hinton & Williams (multi-layer, backprop) 2. 1989 Dean Pomerleau (ALVINN) 3. late 1980’s renewed enthusiasm, hype 4. 1990s more principled approaches 5. 2000’s SVM, Bayesian models became more popular 6. 2010’s deep learning networks, GPU’s 7. 2020’s spiking networks(?)"}{"Fitness Functions": "1. Image processing (1). classification (2). segmentation 2.Language processing (1). translation (2). semantic disambiguation (3). sentiment analysis 3. Combining images and tex (1). automatic captioning 4. Game playing (1). AlphaGo (2). Deep Q-Learning"}{"Aibo Walk Learning (Hornby)": "Two perspectives on the history of Deep Learning Viewpoint 1: Focusing on recent work (after 2012) https://www.cs.toronto.edu/~hinton/absps/NatureDeepReview.pdf Viewpoint 2: Focusing on earlier work (before 2012) http://people.idsia.ch/~juergen/deep-learning-overview.html"}{"Guroo  Humanoid Walk Learning": "1. Central Nervous System (1). Brain (2).Spinal cord 2. Peripheral Nervous System (1). Somatic nervous system (2). Autonomic nervous system (3). Enteric nervous system"}{"Evolved Antenna": "1. “cortex” from Latin word for “bark” (of tree) 2. cortex is a sheet of tissue making up outer layers of brain , 2-6cmthick 3. right and left sides connected by corpus callosum 4. functions: thought, voluntary movement, language, reasoning, perception"}{"Gaps in the Fossil Record?": "1. general term for area of brain between the thalamus and spinal cord 2. includes medulla, pons, tectum, reticular formation and tegmentum 3. functions: breathing, heart rate, blood pressure, and others"}{"Co-Evolution in Nature": "1. from Latin word for “little brain” 2. functions: movement, balance, posture"}{"Co-evolution in Machine Learning": "functions: vision, audition, eye movement, body movement"}{"Evolving Virtual Creatures (Sims)": "1. receives sensory information and relays it to the cerebral cortex 2. also relays information from the cerebral cortex to other areas of the brain, and the spinal cord 3. functions: sensory integration, motor integration"}{"Golem (Lipson)": "1. composed of several different areas at the base of the brain 2. the size of a pea (about 1/300 of the total brain weight) 3. functions: body temperature, emotions, hunger, thirst, circadian rhythms"}{"Strategic Games": "1. group of structures including amygdala, hippocampus, mammillary bodies and cingulate gyrus 2. important for controlling the emotional response to a given situation 3. hippocampus also important for memory 4. functions: emotional behaviour"}{"Sorting Networks #1 (Hillis)": "1. The body is made up of billions of cells. Cells of the nervous system, called neurons, are specialized to carry “messages” through an electrochemical process. 2. The human brain has about 100 billion neurons, and a similar number of support cells called “glia”. 3. Neurons are similar to other cells in the body in some ways, such as: (1). neurons are surrounded by a cell membrane (2). neurons have a nucleus that contains genes (DNA) (3). neurons carry out basic cellular processes like protein synthesis and energy production"}{"Sorting Networks #2 (Hillis)": "1. Neurons have specialized extensions called dendrites and axons Dendrites bring information to the cell body, while axons take information away from the cell body. 2. The axon of one neuron can connect to the dendrite of another neuron through an electrochemical junction called a synapse. 3. Most neurons have only one axon, but the number of dendrites can vary widely: (1). Unipolar and Bipolar neurons have only one dendrite (2). Purkinje neurons can have up to 100,000 dendrites"}{"Iterated Prisoners Dilemma": "1. Dendrites are typically less than a millimetre in length 2. Axons can vary in length from less than a millimetre to more than a metre (motor neurons) 3. Long axons are sometimes surrounded by a myelinated sheath, which prevents the electrical signal from dispersing, and allows it to travel faster (up to 100 m/s)."}{"Artist Critic Coevolution": "1. electrical pulse reaches the endbulb and causes the release of neurotransmitter molecules from little packets (vesicles) through the synaptic membrane 2. transmitter then diffuses through the synaptic cleft to the other side 3. when the neurotransmitter reaches the post-synaptic membrane, it causes a change in polarisation of the membrane 4. the change in potential can be excitatiory (moving the potential towards the threshold) or inhibitory (moving it away from the threshold)"}{"Meta-Game of Learning": "1. human brain has 100 billion neurons with an average of 10,000 synapses each 2. latency is about 3-6 milliseconds 3. therefore, at most a few hundred “steps” in any mental computation, but massively parallel"}